const instruments = [

{
    name: "Гуцинь",

    image: "images/guqin.jpg",

    audio: "audio/guqin.mp3",

    description:
    "Гуцинь — щипковый семиструнный китайский музыкальный инструмент. На гуцине играли очень давно, аж с древних времен, и он традиционно был любим учеными и литераторами как инструмент, обладающий особой утонченностью и изысканностью. Китайцы иногда называют гуцинь «отцом китайской музыки» или «инструментом мудрецов». Гуцинь не следует путать с гучжэном, другим китайским длиннострунным инструментом, у которого тоже нет ладов, но есть подвижные порожки под каждой струной. Легенда гласит, что цинь, самый почитаемый из всех китайских музыкальных инструментов, имеет историю около 5000 лет. Он упоминается в китайских письменных источниках, датируемых почти 3000 лет назад, а его образцы были найдены в гробницах возрастом около 2500 лет. Точное происхождение гуцинь до сих пор является загадкой, которая не утихает на протяжении последних нескольких десятилетий. На гуцине почти всегда играют как на сольном инструменте, поскольку его тихий звук не может конкурировать со звучанием большинства других инструментов или ансамбля. Являясь символом высокой культуры, цинь постоянно появляется во многих проявлениях китайской поп-культуры, в той или иной степени достоверно."
},

{
    name: "Пипа",

    image: "images/pipa.jpg",

    audio: "audio/pipa.mp3",

    description:
    "Пипа — это традиционный китайский четырёхструнный щипковый музыкальный инструмент, который часто называют «китайской лютней». Один из самых известных и распространённых инструментов в китайской музыкальной культуре. Первые упоминания о пипе в литературе относятся к III веку, а первые изображения — к V веку. Однако прототипы инструмента бытовали в Китае уже в конце III века до н. э.. Существует несколько версий происхождения пипы. По одной из них, инструмент мог быть заимствован из Месопотамии и через Центральную Азию попал в Китай по Великому шёлковому пути. Другие исследователи предполагают, что у пипы могли быть и местные корни. Существует несколько версий происхождения пипы. По одной из них, инструмент мог быть заимствован из Месопотамии и через Центральную Азию попал в Китай по Великому шёлковому пути. Другие исследователи предполагают, что у пипы могли быть и местные корни. Пипа используется как сольный, ансамблевый и оркестровый инструмент, а также для аккомпанемента пению и сопровождения декламации. Она широко распространена в Центральном и Южном Китае. "
},

{
    name: "Эрху",

    image: "images/erhu.jpg",

    audio: "audio/erhu.mp3",

    description:
    "Эрху — традиционный китайский смычковый музыкальный инструмент, одна из разновидностей семейства хуцинь. Эрху появился в Китае предположительно в эпоху династии Тан (VII–X вв.) и, вероятно, ведёт происхождение от среднеазиатских смычковых инструментов (например, от сициня). В XX веке музыкант и композитор Лю Тяньхуа сыграл ключевую роль в превращении эрху в полноценный сольный инструмент: он адаптировал западную музыкальную технику и написал для эрху ряд пьес, ставших классикой (например, «Лунная ночь» / Yuè yè). Звук эрху часто сравнивают с человеческим голосом: он способен передавать тонкие эмоциональные оттенки — от светлой грусти до напряжённой драмы. Характерная черта — поперечное вибрато: левой рукой музыкант слегка продавливает струну вниз по круглому грифу, создавая выразительные колебания высоты тона."
},

{
    name: "Дицзы",

    image: "images/dizi.jpg",

    audio: "audio/dizi.mp3",

    description:
    "Дицзы — традиционная китайская поперечная флейта. Есть разные версии происхождения инструмента. По одной из легенд, первую флейту из бамбука велел сделать мифический император Хуан‑ди. По другой версии, поперечная флейта пришла в Китай из Средней Азии — её связывают с посольством Чжан Цяня во времена императора У‑ди (140–87 гг. до н. э.). При этом археологические находки (например, костяные поперечные флейты в провинции Чжэцзян возрастом около 8000 лет) намекают на очень древние местные традиции духовых инструментов. Дицзы держат горизонтально, как обычную поперечную флейту. Чтобы извлечь звук, нужно правильно сформировать амбушюр (положение губ) и направить струю воздуха в отверстие для вдувания. Тон и интонация сильно зависят от силы дыхания, угла подачи воздуха и температуры: из‑за этого звучание может меняться даже в разное время года. Флейта активно используется в традиционной китайской музыке, в ансамблях и оркестрах, а также в сольных партиях — она способна передавать как яркие, энергичные мелодии, так и тонкие, лирические оттенки."
},

{
    name: "Гучжэн",

    image: "images/guzheng.jpg",

    audio: "audio/guzheng.mp3",

    description:
    "Гучжэн — щипковый струнный инструмент, который относят к семейству цитр. Он родственен японскому кото и китайскому цисяньциню, но отличается от них количеством струн и конструкцией струнодержателя.История гучжэна насчитывает более 2500 лет. Его происхождение окутано легендами, и исследователи выделяют несколько ключевых этапов развития: Самые ранние формы появились в эпоху Воюющих царств (475–221 гг. до н. э.) в царстве Цинь. Вероятно, прообразом послужила более ранняя цитра с бамбуковой трубкой, описанная в древнем словаре «Шовэнь Цзецзи». В XX веке гучжэн серьёзно модернизировали: появились стальные струны, были разработаны новые приёмы игры и созданы оригинальные музыкальные сочинения. а протяжении веков гучжэн был важной частью китайской музыкальной традиции: его использовали в сольных выступлениях, ансамблях, как аккомпанемент к пению и в опере."
}

];

let current = 0;

const image = document.getElementById("instrumentImage");
const title = document.getElementById("instrumentName");
const info = document.getElementById("instrumentInfo");
const player = document.getElementById("player");

function showInstrument(index){

    image.src = instruments[index].image;

    title.textContent = instruments[index].name;

    info.textContent = instruments[index].description;

    player.pause();

    player.src = instruments[index].audio;

    player.load();

}

document.getElementById("next").onclick = function(){

    current++;

    if(current >= instruments.length){

        current = 0;

    }

    showInstrument(current);

}

document.getElementById("prev").onclick = function(){

    current--;

    if(current < 0){

        current = instruments.length - 1;

    }

    showInstrument(current);

}

showInstrument(current);